Revit 2026 API

# ScheduleDefinitionRemoveEmbeddedSchedule Method

---

Removes the embedded ScheduleDefinition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveEmbeddedSchedule()
```
```vb
Public Sub RemoveEmbeddedSchedule
```
```cpp
public:
void RemoveEmbeddedSchedule()
```
```fsharp
member RemoveEmbeddedSchedule : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This ScheduleDefinition does not have an embedded ScheduleDefinition. |

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace